Table of Contents
 Class GrpcReflectionServiceFactory
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
Creates a dynamic instance of the interface implemented on server to proxy the calls from grpc client service to grpc server.
public class GrpcReflectionServiceFactory
Inheritance
object
GrpcReflectionServiceFactory
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 CreateInstance<T>(IMethodInvoker)
public static T CreateInstance<T>(IMethodInvoker methodInvoker) where T : class
Parameters
methodInvoker IMethodInvoker
Returns
T
Type Parameters
T
 Edit this page